public class Task1 {
    /* 1. Напишите программу, которая выводит строку «Hello World!»  в консоль. */
    public static void main (String[] args) {
        System.out.printf("Hello World!");
    }
}
